archive/web-gui-node/load-tests/scenarios/health-api.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 120
      arrivalRate: 10
      name: "Health API Load Test"
  defaults:
    headers:
      'Accept': 'application/json'

scenarios:
  - name: "Health Check Endpoints"
    weight: 40
    flow:
      - get:
          url: "/api/health"
          name: "Main Health Check"
          expect:
            - statusCode: [200, 503]
            - contentType: json
            - hasProperty: "status"

  - name: "Detailed Health Check"
    weight: 25
    flow:
      - get:
          url: "/api/health/detailed"
          name: "Detailed Health Check"
          expect:
            - statusCode: [200, 503]
            - contentType: json
            - hasProperty: "services"
            - hasProperty: "system"

  - name: "Health Ping"
    weight: 20
    flow:
      - get:
          url: "/api/health/ping"
          name: "Health Ping"
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: "message"

  - name: "Health Status"
    weight: 10
    flow:
      - get:
          url: "/api/health/status"
          name: "Health Status"
          expect:
            - statusCode: [200, 503]
            - contentType: json

  - name: "Health Metrics"
    weight: 5
    flow:
      - get:
          url: "/api/health/metrics"
          name: "Health Metrics"
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: "system"